In [114]:
import pandas as pd

In [115]:
df = pd.read_csv('/opt/ml/code/input/train.csv')

In [116]:
len(df.customer_id.unique())

5914

In [109]:
array = 'DOT TEST002 BANK CHARGES PADS ADJUST2 CRUK TEST001 ADJUST D M'.split(' ')

array = 'PADS D'.split(' ') # 전처리 대상

In [110]:
df.drop(df[df.product_id.isin(array)].index.values, inplace=True)

In [111]:
df[df.product_id.isin(array)]

Empty DataFrame
Columns: [order_id, product_id, description, quantity, order_date, price, customer_id, country, total]
Index: []

In [112]:
len(df.customer_id.unique())

5914

In [113]:
df.to_csv('/opt/ml/code/input/train_update.csv', index=False)

In [93]:
pd.set_option('display.max_row', 70) # 후처리 대상?
df[df.product_id.isin(['ADJUST', 'ADJUST2', 'TEST001', 'TEST002'])].customer_id.unique()

array([14911, 12745, 16154, 12606, 13054, 12454, 15383, 12706, 12404,
       16840, 12382, 12466, 16291, 12555, 14156, 12858, 14912, 14413,
       14653, 12846, 16575, 12647, 13664, 14285, 16047, 12792, 12709,
       12696, 17130, 15357, 13776, 12600, 17940, 15266, 17867, 16168,
       14380, 13468, 13136, 14079, 17672, 12497, 12471, 15702, 14358,
       12826, 13327, 12346, 12570, 12748, 17050, 16422, 17364])

In [94]:
df[df.product_id.isin(['TEST001'])]

,order_id,product_id,description,quantity,order_date,price,customer_id,country,total
21447,491725,TEST001,This is a test product.,10,2009-12-14 08:34:00,7.425,12346,United Kingdom,74.250
21702,491742,TEST001,This is a test product.,5,2009-12-14 11:00:00,7.425,12346,United Kingdom,37.125
21705,491744,TEST001,This is a test product.,5,2009-12-14 11:02:00,7.425,12346,United Kingdom,37.125
28492,492718,TEST001,This is a test product.,5,2009-12-18 10:47:00,7.425,12346,United Kingdom,37.125
31276,493410,TEST001,This is a test product.,5,2010-01-04 09:24:00,7.425,12346,United Kingdom,37.125
31278,493412,TEST001,This is a test product.,5,2010-01-04 09:53:00,7.425,12346,United Kingdom,37.125
37892,494450,TEST001,This is a test product.,5,2010-01-14 13:50:00,7.425,12346,United Kingdom,37.125
44909,495295,TEST001,This is a test product.,5,2010-01-22 13:30:00,7.425,12346,United Kingdom,37.125
62932,497819,TEST001,This is a test product.,5,2010-02-12 14:58:00,0.000,14103,United Kingdom,0.000
63021,497843,TEST001,This is a test product.,5,2010-02-12 15:47:00,0.000,14827,United Kingdom,0.000
116368,504188,TEST001,This is a test product.,5,2010-04-12 09:52:00,7.425,16454,United Kingdom,37.125
291614,C525272,TEST001,This is a test product.,-1,2010-10-04 16:29:00,7.425,16454,United Kingdom,-7.425
291615,C525273,TEST001,This is a test product.,-1,2010-10-04 16:30:00,7.425,16454,United Kingdom,-7.425
291616,C525274,TEST001,This is a test product.,-1,2010-10-04 16:33:00,7.425,12346,United Kingdom,-7.425
291617,C525275,TEST001,This is a test product.,-2,2010-10-04 16:38:00,7.425,16446,United Kingdom,-14.850

In [99]:
df[df.product_id.isin(['TEST002'])]

,order_id,product_id,description,quantity,order_date,price,customer_id,country,total
28504,492722,TEST002,This is a test product.,1,2009-12-18 10:55:00,1.65,12346,United Kingdom,1.65

In [118]:
df2 = pd.read_csv('/opt/ml/code/input/train_update.csv')

In [122]:
df2[df2.product_id.isin(['D'])]

Empty DataFrame
Columns: [order_id, product_id, description, quantity, order_date, price, customer_id, country, total]
Index: []